-- Вставка данных о теннисных кортах
INSERT INTO courts (surface, location) VALUES
('Грунт', 'Стадион 1'),
('Хард', 'Стадион 2'),
('Трава', 'Стадион 3');

-- Вставка данных о ценах на корты в зависимости от времени
INSERT INTO court_prices (court_id, start_time, end_time, price) VALUES
(1, '08:00:00', '12:00:00', 500.00),  -- Корт 1, цена с 8:00 до 12:00
(1, '12:00:00', '18:00:00', 700.00),  -- Корт 1, цена с 12:00 до 18:00
(2, '08:00:00', '12:00:00', 600.00),  -- Корт 2, цена с 8:00 до 12:00
(2, '12:00:00', '18:00:00', 800.00),  -- Корт 2, цена с 12:00 до 18:00
(3, '08:00:00', '12:00:00', 900.00),  -- Корт 3, цена с 8:00 до 12:00
(3, '12:00:00', '18:00:00', 1100.00); -- Корт 3, цена с 12:00 до 18:00

-- Вставка данных о пользователях
INSERT INTO users (username, password_hash, role) VALUES
('admin','$2b$12$zbeQiq9xnqbiqaunU6KwxeE/WYLfPPTJwMl45boPTHul0k52O1O/q', 'admin');

